# Esercizio Pandas
2024.11.18 17.31

In [ ]:
# imports  
import pandas as pd
import numpy as np
import random

In [ ]:
# creare il dataframe
student_names = ["Alice", "Bob", "Charlie"]
subject_names = ["Math", "Science", "English"]

df_len = 20

students = []
subjects = []
scores = []
for _ in range(df_len):
    students.append(random.choice(student_names))
    subjects.append(random.choice(subject_names))
    scores.append(random.randint(60, 100))
    
data = {"Student":students, 
        "Subject":subjects,
        "Score":scores}

df = pd.DataFrame(data)

In [17]:
df.head()

   Student  Subject  Score
0  Charlie     Math     74
1  Charlie  Science     71
2    Alice  English     73
3    Alice  Science     71
4    Alice  Science     68

In [22]:
# calculate the average score for each student and subject

df_avg = df.groupby(['Student', 'Subject']).mean("Score")
df_avg

                     Score
Student Subject
Alice   English  78.500000
        Science  81.000000
Bob     English  88.000000
        Science  89.666667
Charlie Math     81.750000
        Science  76.833333

In [20]:
# calculate the average score for each student (all subjects)

df.groupby(['Student']).mean("Score")

             Score
Student
Alice    80.166667
Bob      89.250000
Charlie  78.800000

In [21]:
# calculate the average score for each subject (all students)

df.groupby(['Subject']).mean("Score")

             Score
Subject
English  81.666667
Math     81.750000
Science  81.076923